zhao0079/openpilot/flight/PiOS/Boards/STM32205_PX2FMU_Rev1.h
/**
 ******************************************************************************
 * @addtogroup OpenPilotSystem OpenPilot System
 * @{
 * @addtogroup OpenPilotCore OpenPilot Core
 * @{
 * @file       pios_board.h
 * @author     The OpenPilot Team, http://www.openpilot.org Copyright (C) 2010.
 * @brief      Defines board hardware for the OpenPilot Version 1.1 hardware.
 * @see        The GNU Public License (GPL) Version 3
 *
 *****************************************************************************/
/*
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
 * for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, write to the Free Software Foundation, Inc.,
 * 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
 */


#ifndef STM32205_PX2FMU_H_
#define STM32205_PX2FMU_H_


//------------------------
// BOOTLOADER_SETTINGS
//------------------------

//#define FUNC_ID				1
//#define HW_VERSION			01

#define BOOTLOADER_VERSION		0
#define BOARD_TYPE				0x05	// PX2 FMU
#define BOARD_REVISION			0x01 	// prototype (should be a strapping option... silly to hardcode it here)
//#define HW_VERSION			(BOARD_TYPE << 8) | BOARD_REVISION

#define MEM_SIZE				(1024 * 1024)
#define SIZE_OF_DESCRIPTION		(uint8_t)100
#define START_OF_USER_CODE		(uint32_t)0x08010000 // NOTE: must match FLASH ORIGIN in link_STM32F2xx_application.ld
#define SIZE_OF_CODE			(uint32_t) (MEM_SIZE-(START_OF_USER_CODE-0x08000000)-SIZE_OF_DESCRIPTION)

#define HW_TYPE					0		// this is technically meaningless

#define BOARD_READABLE			TRUE
#define BOARD_WRITABLA			TRUE

//------------------------
// WATCHDOG_SETTINGS
//------------------------
#define PIOS_WATCHDOG_TIMEOUT	250
#define PIOS_WDG_REGISTER		RTC_BKP_DR4
#define PIOS_WDG_ACTUATOR		0x0001
#define PIOS_WDG_STABILIZATION 	0x0002
#define PIOS_WDG_AHRS			0x0004
#define PIOS_WDG_MANUAL			0x0008
#define PIOS_WDG_ATTITUDE		0x0010

//------------------------
// TELEMETRY 
//------------------------
#define TELEM_QUEUE_SIZE		20
#define PIOS_TELEM_STACK_SIZE	624

//------------------------
// PIOS_LED
//------------------------
#define PIOS_LED_LED1_GPIO_PORT                 GPIOB
#define PIOS_LED_LED1_GPIO_PIN                  GPIO_Pin_15
#define PIOS_LED_LED2_GPIO_PORT                 GPIOB
#define PIOS_LED_LED2_GPIO_PIN                  GPIO_Pin_14
#define PIOS_LED_NUM                            2
#define PIOS_LED_PORTS                          { PIOS_LED_LED1_GPIO_PORT, PIOS_LED_LED2_GPIO_PORT }
#define PIOS_LED_PINS                           { PIOS_LED_LED1_GPIO_PIN, PIOS_LED_LED2_GPIO_PIN }

//------------------------
// PIOS_SPI
// See also pios_board.c
//------------------------
#define PIOS_SPI_MAX_DEVS		2

/* SPI1 is the onboard sensor bus */
/* TODO: it would be nice to abstract this more */
#define SPI1_CONFIG(_handler)                                           \
{                                                                       \
    .regs    = SPI1,                                                    \
    .remap   = GPIO_AF_SPI1,                                            \
    .use_crc = false,                                                   \
    .init    = {                                                        \
        .SPI_Mode              = SPI_Mode_Master,                       \
        .SPI_Direction         = SPI_Direction_2Lines_FullDuplex,       \
        .SPI_DataSize          = SPI_DataSize_8b,                       \
        .SPI_NSS               = SPI_NSS_Soft,                          \
        .SPI_FirstBit          = SPI_FirstBit_MSB,                      \
        .SPI_CRCPolynomial     = 7,                                     \
        .SPI_CPOL              = SPI_CPOL_High,                         \
        .SPI_CPHA              = SPI_CPHA_2Edge,                        \
        .SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8,               \
    },                                                                  \
    .dma     = {                                                        \
        /* .ahb_clk - not required */                                   \
        .irq = {                                                        \
            .handler = _handler,                                        \
            .flags   = (DMA_IT_TCIF3 | DMA_IT_TEIF3 | DMA_IT_HTIF3),    \
            .init    = {                                                \
                .NVIC_IRQChannel                   = DMA2_Stream0_IRQn, \
                .NVIC_IRQChannelPreemptionPriority = PIOS_IRQ_PRIO_HIGH, \
                .NVIC_IRQChannelSubPriority        = 0,                 \
                .NVIC_IRQChannelCmd                = ENABLE,            \
            },                                                          \
        },                                                              \
        .rx = {                                                         \
            .channel = DMA2_Stream0,                                    \
            .init = {                                                   \
                .DMA_Channel            = DMA_Channel_3,                \
                .DMA_PeripheralBaseAddr = (uint32_t)&(SPI1->DR),        \
                /* .DMA_Memory0BaseAddr */                              \
                .DMA_DIR                = DMA_DIR_PeripheralToMemory,   \
                /* .DMA_BufferSize */                                   \
                .DMA_PeripheralInc      = DMA_PeripheralInc_Disable,    \
                /* .DMA_BufferSize */                                   \
                .DMA_PeripheralInc      = DMA_PeripheralInc_Disable,    \
                .DMA_MemoryInc          = DMA_MemoryInc_Enable,         \
                .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,  \
                .DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte,      \
                .DMA_Mode               = DMA_Mode_Normal,              \
                .DMA_Priority           = DMA_Priority_High,            \
                .DMA_FIFOMode           = DMA_FIFOMode_Disable,         \
                /* .DMA_FIFOThreshold */                                \
                .DMA_MemoryBurst        = DMA_MemoryBurst_Single,       \
                .DMA_PeripheralBurst    = DMA_PeripheralBurst_Single    \
            },                                                          \
        },                                                              \
        .tx = {                                                         \
            .channel = DMA2_Stream3,                                    \
            .init = {                                                   \
                .DMA_Channel            = DMA_Channel_3,                \
                /* .DMA_Memory0BaseAddr */                              \
                .DMA_PeripheralBaseAddr = (uint32_t)&(SPI1->DR),        \
                .DMA_DIR                = DMA_DIR_MemoryToPeripheral,   \
                /* .DMA_BufferSize */                                   \
                .DMA_PeripheralInc      = DMA_PeripheralInc_Disable,    \
                .DMA_MemoryInc          = DMA_MemoryInc_Enable,         \
                .DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte,  \
                .DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte,      \
                .DMA_Mode               = DMA_Mode_Normal,              \
                .DMA_Priority           = DMA_Priority_High,            \
                .DMA_FIFOMode           = DMA_FIFOMode_Disable,         \
                /* .DMA_FIFOThreshold */                                \
                .DMA_MemoryBurst        = DMA_MemoryBurst_Single,       \
                .DMA_PeripheralBurst    = DMA_PeripheralBurst_Single    \
            },                                                          \
        },                                                              \
    },                                                                  \
    .sclk = {                                                           \
        .gpio = GPIOA,                                                  \
        .init = {                                                       \
            .GPIO_Pin   = GPIO_Pin_5,                                   \
            .GPIO_Mode  = GPIO_Mode_AF,                                 \
            .GPIO_Speed = GPIO_Speed_100MHz,                             \
            .GPIO_OType = GPIO_OType_PP,                                \
            .GPIO_PuPd  = GPIO_PuPd_UP,                                 \
        },                                                              \
    },                                                                  \
    .miso = {                                                           \
        .gpio = GPIOA,                                                  \
        .init = {                                                       \
            .GPIO_Pin   = GPIO_Pin_6,                                   \
            .GPIO_Mode  = GPIO_Mode_AF,                                 \
            .GPIO_Speed = GPIO_Speed_50MHz,                             \
            .GPIO_OType = GPIO_OType_PP,                                \
            .GPIO_PuPd  = GPIO_PuPd_UP,                                 \
        },                                                              \
    },                                                                  \
    .mosi = {                                                           \
        .gpio = GPIOA,                                                  \
        .init = {                                                       \
            .GPIO_Pin   = GPIO_Pin_7,                                   \
            .GPIO_Mode  = GPIO_Mode_AF,                                 \
            .GPIO_Speed = GPIO_Speed_50MHz,                             \
            .GPIO_OType = GPIO_OType_PP,                                \
            .GPIO_PuPd  = GPIO_PuPd_UP,                                 \
        },                                                              \
    },                                                                  \
    .slave_count = 2,                                                   \
    .ssel = {                                                           \
        {                                                               \
            .gpio = GPIOC,                                              \
            .init = {                                                   \
                .GPIO_Pin   = GPIO_Pin_14,                              \
                .GPIO_Mode  = GPIO_Mode_OUT,                            \
                .GPIO_Speed = GPIO_Speed_50MHz,                         \
                .GPIO_OType = GPIO_OType_PP,                            \
                .GPIO_PuPd  = GPIO_PuPd_UP,                             \
            },                                                          \
        },                                                              \
        {                                                               \
            .gpio = GPIOC,                                              \
            .init = {                                                   \
                .GPIO_Pin   = GPIO_Pin_15,                              \
                .GPIO_Mode  = GPIO_Mode_OUT,                            \
                .GPIO_Speed = GPIO_Speed_50MHz,                         \
                .GPIO_OType = GPIO_OType_PP,                            \
                .GPIO_PuPd  = GPIO_PuPd_UP,                             \
            },                                                          \
        },                                                              \
    },                                                                  \
}

