zhao0079/openpilot/flight/PiOS/Boards/STM32205_PX2FMU_Rev1.h
#define SPI_CS_GYRO				0
#define SPI_CS_ACCEL			1

//------------------------
// PIOS_I2C
// See also pios_board.c
//------------------------
#define PIOS_I2C_MAX_DEVS		3
extern uint32_t pios_i2c_main_adapter_id;
#define PIOS_I2C_MAIN_ADAPTER	(pios_i2c_main_adapter_id)
extern uint32_t pios_i2c_esc_adapter_id;
#define PIOS_I2C_ESC_ADAPTER	(pios_i2c_esc_adapter_id)
extern uint32_t pios_i2c_external_adapter_id;
#define PIOS_I2C_EXTERNAL_ADAPTER	(pios_i2c_external_adapter_id)

/* I2C as available on the PX2 FMU */
#include <pios_i2c_config.h>

/* motor control */
#define I2C1_CONFIG(_ev_handler, _er_handler)	\
		I2C_CONFIG(I2C1, _ev_handler, _er_handler, GPIOB, GPIO_Pin_8, GPIOB, GPIO_Pin_9)

/* onboard sensors and EEPROM, IO comms */
#define I2C2_CONFIG(_ev_handler, _er_handler)	\
		I2C_CONFIG(I2C2, _ev_handler, _er_handler, GPIOB, GPIO_Pin_10, GPIOB, GPIO_Pin_11)

/* offboard sensors */
#define I2C3_CONFIG(_ev_handler, _er_handler)	\
		I2C_CONFIG(I2C3, _ev_handler, _er_handler, GPIOA, GPIO_Pin_8, GPIOC, GPIO_Pin_9)

#define PIOS_I2C_EEPROM_ADDRESS					0x50		/* on the MAIN bus */
#define PIOS_I2C_EEPROM_SIZE					(16 * 1024)

//------------------------
// PIOS_BMP085
//------------------------
#define PIOS_BMP085_EOC_GPIO_PORT               GPIOA
#define PIOS_BMP085_EOC_GPIO_PIN                GPIO_Pin_10
#define PIOS_BMP085_EOC_PORT_SOURCE             EXTI_PortSourceGPIOA
#define PIOS_BMP085_EOC_PIN_SOURCE              EXTI_PinSource10
#define PIOS_BMP085_EOC_EXTI_LINE               EXTI_Line10
#define PIOS_BMP085_EOC_IRQn                    EXTI15_10_IRQn
#define PIOS_BMP085_EOC_PRIO                    PIOS_IRQ_PRIO_LOW
//#define PIOS_BMP085_OVERSAMPLING                2
#define PIOS_BMP085_OVERSAMPLING                3

//------------------------
// PIOS_HMC5883
//------------------------
#define PIOS_HMC5883_DRDY_GPIO_PORT				GPIOB
#define PIOS_HMC5883_DRDY_GPIO_PIN				GPIO_Pin_1
#define PIOS_HMC5883_DRDY_PORT_SOURCE			EXTI_PortSourceGPIOB
#define PIOS_HMC5883_DRDY_PIN_SOURCE			EXTI_PinSource1
#define PIOS_HMC5883_DRDY_EXTI_LINE				EXTI_Line1	// XXX probably wrong
#define PIOS_HMC5883_DRDY_IRQn					EXTI1_IRQn
#define PIOS_HMC5883_DRDY_PRIO					PIOS_IRQ_PRIO_HIGH

//-------------------------
// PIOS_USART
//-------------------------
#define PIOS_USART_MAX_DEVS             4

#define PIOS_USART_RX_BUFFER_SIZE       512
#define PIOS_USART_TX_BUFFER_SIZE       512

/* USARTs as available on the PX2 FMU */
#include <pios_usart_config.h>

#define USART1_CONFIG(_baudrate, _handler)	\
		USART_CONFIG(USART1, _baudrate, _handler, GPIOB, GPIO_Pin_7, GPIOB, GPIO_Pin_6)

#define USART2_CONFIG(_baudrate, _handler)	\
		USART_CONFIG(USART2, _baudrate, _handler, GPIOA, GPIO_Pin_3, GPIOA, GPIO_Pin_2)

#define UART5_CONFIG(_baudrate, _handler) 	\
		USART_CONFIG(UART5, _baudrate, _handler, GPIOD, GPIO_Pin_2, GPIOC, GPIO_Pin_12)

#define USART6_CONFIG(_baudrate, _handler)	\
		USART_CONFIG(USART6, _baudrate, _handler, GPIOC, GPIO_Pin_7, GPIOC, GPIO_Pin_6)

//-------------------------
// PIOS_COM
//
// See also pios_board.c
//-------------------------
#define PIOS_COM_MAX_DEVS               (PIOS_USART_MAX_DEVS + 1)	// +1 for USB

#define PIOS_COM_TELEM_BAUDRATE         57600
extern uint32_t pios_com_telem_rf_id;
#define PIOS_COM_TELEM_RF               (pios_com_telem_rf_id)

#define PIOS_COM_GPS_BAUDRATE           57600
extern uint32_t pios_com_gps_id;
#define PIOS_COM_GPS                    (pios_com_gps_id)

extern uint32_t pios_com_telem_usb_id;
#define PIOS_COM_TELEM_USB              (pios_com_telem_usb_id)

#define PIOS_COM_CONTROL_BAUDRATE		115200
extern uint32_t pios_com_control_id;
#define PIOS_COM_CONTROL				(pios_com_control_id)

#define PIOS_COM_AUX_BAUDRATE           57600
extern uint32_t pios_com_aux_id;
#define PIOS_COM_AUX                    (pios_com_aux_id)

#define PIOS_COM_DEBUG                  PIOS_COM_CONTROL	/* due to the AUX channel missing drivers on early FMU boards */

//-------------------------
// Delay Timer
//-------------------------
#define PIOS_DELAY_TIMER				TIM2
#define PIOS_DELAY_TIMER_RCC_FUNC		do {} while(0)

//-------------------------
// System Settings
//-------------------------
#define PIOS_MASTER_CLOCK				120000000					// XXX should really get this from the BSP
#define PIOS_PERIPHERAL_CLOCK			(PIOS_MASTER_CLOCK / 2)		// XXX should really get this from the BSP
#if defined(USE_BOOTLOADER)
#define PIOS_NVIC_VECTTAB_FLASH			(START_OF_USER_CODE)		// XXX should be getting this from the symbol table
#else
#define PIOS_NVIC_VECTTAB_FLASH			((uint32_t)0x08000000)		// XXX should be getting this from the symbol table
#endif

//-------------------------
// Interrupt Priorities
//-------------------------
#define PIOS_IRQ_PRIO_LOW				12			// lower than RTOS
#define PIOS_IRQ_PRIO_MID				8			// higher than RTOS
#define PIOS_IRQ_PRIO_HIGH				5			// for SPI, ADC, I2C etc...
#define PIOS_IRQ_PRIO_HIGHEST			4			// for USART etc...

//-------------------------
// Receiver PPM input
//-------------------------
#define PIOS_PPM_GPIO_PORT				GPIOA
#define PIOS_PPM_GPIO_PIN				GPIO_Pin_9
#define PIOS_PPM_GPIO_REMAP				GPIO_AF_TIM1
#define PIOS_PPM_TIM_CHANNEL			TIM_Channel_2
#define PIOS_PPM_TIM_CCR				TIM_IT_CC2
#define PIOS_PPM_TIM					TIM1
#define PIOS_PPM_TIM_IRQ				TIM1_CC_IRQn
#define PIOS_PPM_NUM_INPUTS				8  //Could be more if needed


//-------------------------
// ADC
// PIOS_ADC_PinGet(0) = External voltage
// PIOS_ADC_PinGet(1) = AUX1 (PX2IO external pressure port)
// PIOS_ADC_PinGet(2) = AUX2
// PIOS_ADC_PinGet(3) = AUX3
//-------------------------

#define PIOS_DMA_PIN_CONFIG												\
	{																	\
		{GPIOC,	GPIO_Pin_0,	ADC_Channel_10},							\
		{GPIOC, GPIO_Pin_1,	ADC_Channel_11},							\
		{GPIOC,	GPIO_Pin_2,	ADC_Channel_12},							\
		{GPIOC, GPIO_Pin_3,	ADC_Channel_13},							\
		{NULL,	0,			ADC_Channel_16}		/* Temperature sensor */\
	}

/* we have to do all this to satisfy the PIOS_ADC_MAX_SAMPLES define in pios_adc.h */
/* which is annoying because this then determines the rate at which we generate buffer turnover events */
/* the objective here is to get enough buffer space to support 100Hz averaging rate */
#define PIOS_ADC_NUM_CHANNELS		4
#define PIOS_ADC_MAX_OVERSAMPLING	10
#define PIOS_ADC_USE_ADC2			0


