zhao0079/openpilot/flight/PiOS/Boards/STM32205_PX2FMU_Rev1.h
#if 0
//#define PIOS_ADC_OVERSAMPLING_RATE            1
#define PIOS_ADC_USE_TEMP_SENSOR                1
#define PIOS_ADC_TEMP_SENSOR_ADC                ADC1
#define PIOS_ADC_TEMP_SENSOR_ADC_CHANNEL        1
#define PIOS_ADC_PIN1_GPIO_PORT                 GPIOC                   // PC0 (Power Sense - Voltage)
#define PIOS_ADC_PIN1_GPIO_PIN                  GPIO_Pin_0              // ADC123_IN10
#define PIOS_ADC_PIN1_GPIO_CHANNEL              ADC_Channel_10
#define PIOS_ADC_PIN1_ADC                       ADC1
#define PIOS_ADC_PIN1_ADC_NUMBER                3
#define PIOS_ADC_PIN2_GPIO_PORT                 GPIOC                   // PC3 (AUX 1)
#define PIOS_ADC_PIN2_GPIO_PIN                  GPIO_Pin_3              // ADC123_IN13
#define PIOS_ADC_PIN2_GPIO_CHANNEL              ADC_Channel_13
#define PIOS_ADC_PIN2_ADC                       ADC2
#define PIOS_ADC_PIN2_ADC_NUMBER                1
#define PIOS_ADC_PIN3_GPIO_PORT                 GPIOC                   // PC1 (AUX 2)
#define PIOS_ADC_PIN3_GPIO_PIN                  GPIO_Pin_1              // ADC123_IN11
#define PIOS_ADC_PIN3_GPIO_CHANNEL              ADC_Channel_11
#define PIOS_ADC_PIN3_ADC                       ADC2
#define PIOS_ADC_PIN3_ADC_NUMBER                3
#define PIOS_ADC_PIN4_GPIO_PORT                 GPIOC                   // PC2 (AUX 3)
#define PIOS_ADC_PIN4_GPIO_PIN                  GPIO_Pin_2              // ADC123_IN12
#define PIOS_ADC_PIN4_GPIO_CHANNEL              ADC_Channel_12
#define PIOS_ADC_PIN4_ADC                       ADC1
#define PIOS_ADC_PIN4_ADC_NUMBER                4
#define PIOS_ADC_NUM_PINS                       4
#define PIOS_ADC_PORTS                          { PIOS_ADC_PIN1_GPIO_PORT, PIOS_ADC_PIN2_GPIO_PORT, PIOS_ADC_PIN3_GPIO_PORT, PIOS_ADC_PIN4_GPIO_PORT }
#define PIOS_ADC_PINS                           { PIOS_ADC_PIN1_GPIO_PIN, PIOS_ADC_PIN2_GPIO_PIN, PIOS_ADC_PIN3_GPIO_PIN, PIOS_ADC_PIN4_GPIO_PIN }
#define PIOS_ADC_CHANNELS                       { PIOS_ADC_PIN1_GPIO_CHANNEL, PIOS_ADC_PIN2_GPIO_CHANNEL, PIOS_ADC_PIN3_GPIO_CHANNEL, PIOS_ADC_PIN4_GPIO_CHANNEL }
#define PIOS_ADC_MAPPING                        { PIOS_ADC_PIN1_ADC, PIOS_ADC_PIN2_ADC, PIOS_ADC_PIN3_ADC, PIOS_ADC_PIN4_ADC }
#define PIOS_ADC_CHANNEL_MAPPING                { PIOS_ADC_PIN1_ADC_NUMBER, PIOS_ADC_PIN2_ADC_NUMBER, PIOS_ADC_PIN3_ADC_NUMBER, PIOS_ADC_PIN4_ADC_NUMBER }
#define PIOS_ADC_NUM_CHANNELS                   (PIOS_ADC_NUM_PINS + PIOS_ADC_USE_TEMP_SENSOR)
#define PIOS_ADC_NUM_ADC_CHANNELS               2
#define PIOS_ADC_CLOCK_FUNCTION                 do {} while(0)
#define PIOS_ADC_ADCCLK                         RCC_PCLK2_Div8
                                                /* RCC_PCLK2_Div2: ADC clock = PCLK2/2 */
                                                /* RCC_PCLK2_Div4: ADC clock = PCLK2/4 */
                                                /* RCC_PCLK2_Div6: ADC clock = PCLK2/6 */
                                                /* RCC_PCLK2_Div8: ADC clock = PCLK2/8 */
#define PIOS_ADC_SAMPLE_TIME                    ADC_SampleTime_480Cycles
                                                /* Sample time: */
                                                /* With an ADCCLK = 14 MHz and a sampling time of 293.5 cycles: */
                                                /* Tconv = 239.5 + 12.5 = 252 cycles = 18us */
                                                /* (1 / (ADCCLK / CYCLES)) = Sample Time (uS) */
#define PIOS_ADC_IRQ_PRIO                       PIOS_IRQ_PRIO_LOW
#define PIOS_ADC_MAX_OVERSAMPLING               10
#define PIOS_ADC_RATE                           (120.0e6 / 1 / 8 / 252 / PIOS_ADC_NUM_ADC_CHANNELS)
#endif

//-------------------------
// GPIO
//-------------------------
#define PIOS_GPIO_1_PORT                        GPIOC
#define PIOS_GPIO_1_PIN                         GPIO_Pin_4
#define PIOS_GPIO_2_PORT                        GPIOC
#define PIOS_GPIO_2_PIN                         GPIO_Pin_5
#define PIOS_GPIO_PORTS                         { PIOS_GPIO_1_PORT, PIOS_GPIO_2_PORT}
#define PIOS_GPIO_PINS                          { PIOS_GPIO_1_PIN, PIOS_GPIO_2_PIN}
#define PIOS_GPIO_NUM                           2

#define GPIO_EXT1								0
#define GPIO_EXT2								1

//-------------------------
// USB
//-------------------------
#define PIOS_USB_ENABLED                        1
#define PIOS_USB_DETECT_GPIO_PORT               GPIOA
#define PIOS_USB_DETECT_GPIO_PIN                GPIO_Pin_9
#define PIOS_USB_DETECT_EXTI_LINE               EXTI_Line4
#define PIOS_IRQ_USB_PRIORITY                   PIOS_IRQ_PRIO_MID
#define PIOS_USB_RX_BUFFER_SIZE                 512
#define PIOS_USB_TX_BUFFER_SIZE                 512

/**
 * glue macros for file IO
 * STM32 uses DOSFS for file IO
 */
#define PIOS_FOPEN_READ(filename,file)					DFS_OpenFile(&PIOS_SDCARD_VolInfo, (uint8_t *)filename, DFS_READ, PIOS_SDCARD_Sector, &file) != DFS_OK
#define PIOS_FOPEN_WRITE(filename,file)					DFS_OpenFile(&PIOS_SDCARD_VolInfo, (uint8_t *)filename, DFS_WRITE, PIOS_SDCARD_Sector, &file) != DFS_OK
#define PIOS_FREAD(file,bufferadr,length,resultadr)     DFS_ReadFile(file, PIOS_SDCARD_Sector, (uint8_t*)bufferadr, resultadr, length) != DFS_OK
#define PIOS_FWRITE(file,bufferadr,length,resultadr)    DFS_WriteFile(file, PIOS_SDCARD_Sector, (uint8_t*)bufferadr, resultadr, length)
#define PIOS_FCLOSE(file)               				DFS_Close(&file)
#define PIOS_FUNLINK(filename)          				DFS_UnlinkFile(&PIOS_SDCARD_VolInfo, (uint8_t *)filename, PIOS_SDCARD_Sector)


#endif /* STM32205_PX2FMU_H_ */
/**
 * @}
 * @}
 */
